
{{alias}}( n )
    Evaluates the double factorial of `n` as a single-precision floating-point
    number.

    If `n` is greater than `56`, the function returns `NaN`, as larger double
    factorial values cannot be accurately represented due to limitations of
    single-precision floating-point format.

    If not provided a nonnegative integer value, the function returns `NaN`.

    If provided `NaN`, the function returns `NaN`.

    Parameters
    ----------
    n: number
        Input value.

    Returns
    -------
    y: number
        Double factorial.

    Examples
    --------
    > var y = {{alias}}( 3 )
    3
    > y = {{alias}}( 4 )
    8
    > y = {{alias}}( 57 )
    Infinity
    > y = {{alias}}( -10 )
    NaN
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

