
{{alias}}( x )
    Computes the cosine of a single-precision floating-point number (in
    degrees).

    Parameters
    ----------
    x: number
        Input value (in degrees).

    Returns
    -------
    y: number
        Cosine.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    1.0
    > y = {{alias}}( 90.0 )
    0.0
    > y = {{alias}}( 60.0 )
    ~0.5
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

